---
kind: method
id: M:Autodesk.Revit.DB.ExtrusionRoof.GetProfile
source: html/0cea252b-0609-0ba9-460a-67dc0cca6e20.htm
---
# Autodesk.Revit.DB.ExtrusionRoof.GetProfile Method

Retrieve the Profile of ExtrusionRoof.

## Syntax (C#)
```csharp
public ModelCurveArray GetProfile()
```